app/Http/Controllers/CommandeController.php

select * from `commandes` where `user_id` = 1
---
    public function show($id)
    {
        $id = Auth::user()->id;
        $commandes = Commande::where('user_id', $id)->get();