app/Http/Controllers/HomeController.php

    public function index()
    {

        //récupérer les produits avec ses catégories
        $categories = Categorie::all();
        $categories->load('produits.images');
---
select * from `categories`
select * from `categories` where `categories`.`id` in (1, 2, 3, 4)
select * from `images` where `images`.`produit_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25)
select * from `produits` where `produits`.`categorie_id` in (1, 2, 3, 4) limit 4