app/Http/Controllers/ProduitController.php

    public function index()
    {


         //afficher les produits par ordre croissant
        $produits = Produit::orderBy('nom', 'ASC')->get();
---
select * from `produits` order by `nom` desc